app/views/templates/show.html.erb

SELECT "questions".* FROM "questions" WHERE "questions"."template_id" = ?  [["template_id", 1]]
---
  <%= @template.name %>
  <% @template.questions.each do |item| %>