app/views/facilities/show.html.erb

  <strong>Items</strong>
  <% @facility.facility_items.each do |item| %>
---
SELECT "facility_items".* FROM "facility_items" WHERE "facility_items"."facility_id" = ?  [["facility_id", 1]]