app/views/work/facility.html.erb

<div class="list-group">
    <% @template.facility_item.each do |item| %>
---
SELECT "facilities"."id" FROM "facilities" INNER JOIN "facility_items" ON "facilities"."id" = "facility_items"."facility_id" INNER JOIN "template_facility_items" ON "facility_items"."id" = "template_facility_items"."facility_item_id" WHERE "template_facility_items"."template_id" = ?  [["template_id", 1]]