app/views/protocols/show.html.erb

SELECT "results".* FROM "results" WHERE "results"."protocol_id" = ?  [["protocol_id", 3]]
---

<% @protocol.results.each do |r| %>