app/controllers/admin_controller.rb

SELECT "schedulings".* FROM "schedulings" WHERE (start_date < '2017-11-09 15:41:42.047940') AND (end_date > '2017-11-09 15:41:42.048942')
SELECT "facility_items".* FROM "facility_items" WHERE "facility_items"."template_id" = ?  [["template_id", 1]]
SELECT COUNT(*) FROM "protocols" WHERE "protocols"."completed" = ?  [["completed", "t"]]
---
    def index
       @date = DateTime.now.strftime("%Y-%d-%m")
       @work = Scheduling.where(start_date: DateTime.now)
       for item in @work do
        @facility_items = FacilityItem.where(template_id: item.template_id)
       end
       @finished = Protocol.where(completed: true).count