app/controllers/facilities_controller.rb

  def index
    @facilities = Facility.order(:name).page params[:page]
---
SELECT  "facilities".* FROM "facilities" ORDER BY "facilities"."name" ASC LIMIT ? OFFSET ?  [["LIMIT", 25], ["OFFSET", 125]]
SELECT COUNT(*) FROM (SELECT  1 FROM "facilities" ORDER BY "facilities"."name" ASC LIMIT ? OFFSET ?) subquery_for_count  [["LIMIT", 25], ["OFFSET", 0]]

  def create
    @facility = Facility.new(facility_params)

    respond_to do |format|
      if @facility.save
---
INSERT INTO "facilities" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Facility 1"], ["created_at", "2017-11-06 07:54:22.811372"], ["updated_at", "2017-11-06 07:54:22.811372"]]

  def update
    respond_to do |format|
      if @facility.update(facility_params)
---
UPDATE "facilities" SET "name" = ?, "updated_at" = ? WHERE "facilities"."id" = ?  [["name", "fasfsafss"], ["updated_at", "2017-11-07 20:32:00.259866"], ["id", 104]]

  def destroy
    @facility.destroy
---
DELETE FROM "facilities" WHERE "facilities"."id" = ?  [["id", 1]]

    def set_facility
      @facility = Facility.find(params[:id])
---
SELECT  "facilities".* FROM "facilities" WHERE "facilities"."id" = ? LIMIT ?  [["id", 126], ["LIMIT", 1]]