app/controllers/facility_items_controller.rb

SELECT  "facility_items".* FROM "facility_items" WHERE "facility_items"."facility_id" = ? ORDER BY "facility_items"."name" ASC LIMIT ? OFFSET ?  [["facility_id", nil], ["LIMIT", 25], ["OFFSET", 0]]
SELECT COUNT(*) FROM (SELECT  1 FROM "facility_items" WHERE "facility_items"."facility_id" = ? ORDER BY "facility_items"."name" ASC LIMIT ? OFFSET ?) subquery_for_count  [["facility_id", nil], ["LIMIT", 25], ["OFFSET", 0]]
SELECT  "facilities".* FROM "facilities" WHERE "facilities"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
SELECT  "facility_items".* FROM "facility_items" WHERE "facility_items"."facility_id" = ? LIMIT ?  [["facility_id", 159], ["LIMIT", 11]]
---
  def index
    if facility_params[:facility_id]
      @facility_items = FacilityItem.where(facility_id: @facility.id).order(:name).page params[:page]
    else
      @facility_items = []
      for value in @template.template_facility_item do
        @facility_items.push(FacilityItem.find(value.facility_item_id))

SELECT  "facilities".* FROM "facilities" ORDER BY "facilities"."name" ASC LIMIT ? OFFSET ?  [["LIMIT", 25], ["OFFSET", 0]]
SELECT COUNT(*) FROM (SELECT  1 FROM "facilities" ORDER BY "facilities"."name" ASC LIMIT ? OFFSET ?) subquery_for_count  [["LIMIT", 25], ["OFFSET", 0]]
---
  def add
    @facility = Facility.order(:name).page params[:page]

INSERT INTO "facility_items" ("name", "facility_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Item 1"], ["facility_id", 1], ["created_at", "2017-11-06 08:18:10.676128"], ["updated_at", "2017-11-06 08:18:10.676128"]]
---
  def create
    @facility_item = FacilityItem.new(facility_item_params)

    respond_to do |format|
      if @facility_item.save

UPDATE "facility_items" SET "template_id" = ?, "updated_at" = ? WHERE "facility_items"."id" = ?  [["template_id", 1], ["updated_at", "2017-11-06 12:56:17.920102"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @facility_item.update(facility_item_params)

DELETE FROM "facility_items" WHERE "facility_items"."id" = ?  [["id", 6]]
---
  def destroy
    @facility_item.destroy

SELECT "template_facility_items"."id" FROM "template_facility_items" WHERE "template_facility_items"."facility_item_id" = ?  [["facility_item_id", 159]]
---
    def set_facility_item
        @facility_item = FacilityItem.find(params[:id])

SELECT  "facilities".* FROM "facilities" WHERE "facilities"."id" = ? LIMIT ?  [["id", 80], ["LIMIT", 1]]
---
    def set_facility
      if facility_params[:facility_id]
        @facility = Facility.find(facility_params[:facility_id])

SELECT  "templates".* FROM "templates" WHERE "templates"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_template
      if template_params[:template_id]
        @template = Template.find(template_params[:template_id])