app/controllers/facility_items_controller.rb

  def index
    @facility_items = FacilityItem.all
---
SELECT "facility_items".* FROM "facility_items"