app/controllers/protocols_controller.rb

  def index
    @protocols = Protocol.all
---
SELECT "protocols".* FROM "protocols"

  def create
    @protocol = Protocol.new(protocol_params)

    respond_to do |format|
      if @protocol.save
---
INSERT INTO "protocols" ("completed", "created_at", "updated_at") VALUES (?, ?, ?)  [["completed", "f"], ["created_at", "2017-11-15 08:26:40.131289"], ["updated_at", "2017-11-15 08:26:40.131289"]]

  def destroy
    @protocol.destroy
---
DELETE FROM "protocols" WHERE "protocols"."id" = ?  [["id", 4]]

    def set_protocol
      @protocol = Protocol.includes(:results).find(params[:id])
---
SELECT  "protocols".* FROM "protocols" WHERE "protocols"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT "results".* FROM "results" WHERE "results"."protocol_id" = ?  [["protocol_id", 3]]