app/controllers/questions_controller.rb

  def index
    @questions = Question.where(template_id: template_params[:template_id]).order(:question).page params[:page]
---
SELECT  "questions".* FROM "questions" WHERE "questions"."template_id" = ? ORDER BY "questions"."question" ASC LIMIT ? OFFSET ?  [["template_id", 8], ["LIMIT", 25], ["OFFSET", 0]]
SELECT COUNT(*) FROM (SELECT  1 FROM "questions" WHERE "questions"."template_id" = ? ORDER BY "questions"."question" ASC LIMIT ? OFFSET ?) subquery_for_count  [["template_id", 8], ["LIMIT", 25], ["OFFSET", 0]]