app/controllers/questions_controller.rb

SELECT  "questions".* FROM "questions" WHERE (template_id = 8) ORDER BY "questions"."question" ASC LIMIT ? OFFSET ?  [["LIMIT", 25], ["OFFSET", 0]]
SELECT COUNT(*) FROM (SELECT  1 FROM "questions" WHERE (template_id = 8) ORDER BY "questions"."question" ASC LIMIT ? OFFSET ?) subquery_for_count  [["LIMIT", 25], ["OFFSET", 0]]
---
  def index
    @questions = Question.order(:question).page params[:page]

INSERT INTO "questions" ("question", "description", "template_id", "required", "images", "comment", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @question = Question.new(question_params)

    respond_to do |format|
      if @question.save

UPDATE "questions" SET "question" = ?, "description" = ?, "updated_at" = ? WHERE "questions"."id" = ?  [["question", "Enter remark"], ["description", ""], ["updated_at", "2017-11-09 15:28:36.265937"], ["id", 4]]
---
  def update
    respond_to do |format|
      if @question.update(question_params)

SELECT  "templates".* FROM "templates" WHERE "templates"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_template
      if template_params[:template_id]
        @template = Template.find(template_params[:template_id])