app/controllers/schedulings_controller.rb

  def index
    @schedulings = Scheduling.all
---
SELECT "schedulings".* FROM "schedulings"

  def create
    @scheduling = Scheduling.new(scheduling_params)

    respond_to do |format|
      if @scheduling.save
---
INSERT INTO "schedulings" ("name", "template_id", "start_date", "end_date", "monday", "thuesday", "wendsday", "thursday", "friday", "saturday", "sunday", "week_duration", "delay", "notification", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def destroy
    @scheduling.destroy
---
DELETE FROM "schedulings" WHERE "schedulings"."id" = ?  [["id", 2]]

    def set_scheduling
      @scheduling = Scheduling.find(params[:id])
---
SELECT  "schedulings".* FROM "schedulings" WHERE "schedulings"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

    def set_template
      if template_params[:template_id]
        @template = Template.find(template_params[:template_id])
---
SELECT  "templates".* FROM "templates" WHERE "templates"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]