app/controllers/templates_controller.rb

SELECT  "templates".* FROM "templates" ORDER BY "templates"."name" ASC LIMIT ? OFFSET ?  [["LIMIT", 25], ["OFFSET", 0]]
SELECT COUNT(*) FROM (SELECT  1 FROM "templates" ORDER BY "templates"."name" ASC LIMIT ? OFFSET ?) subquery_for_count  [["LIMIT", 25], ["OFFSET", 0]]
---
  def index
    @templates = Template.order(:name).page params[:page]

SELECT  "templates".* FROM "templates" WHERE "templates"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
INSERT INTO "facility_items" ("name", "facility_id", "created_at", "updated_at", "template_id") VALUES (?, ?, ?, ?, ?)  [["name", "Christiansen Light"], ["facility_id", 151], ["created_at", "2017-11-09 10:07:51.084220"], ["updated_at", "2017-11-09 10:07:51.084220"], ["template_id", 1]]
UPDATE "template_facility_items" SET "template_id" = NULL WHERE "template_facility_items"."template_id" = ?  [["template_id", 1]]
---
  def addFacilityItems
    facility_items = items_params[:items]
    template = Template.find(items_params[:template_id])
    template.template_facility_item.delete_all
    if facility_items
      for value in facility_items do
        template.template_facility_item.build(:facility_item_id => value,:template_id => template.id)
      end
    end
    respond_to do |format|
      if template.save!

INSERT INTO "templates" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Template 1"], ["created_at", "2017-11-06 08:46:04.447446"], ["updated_at", "2017-11-06 08:46:04.447446"]]
---
  def create
    @template = Template.new(template_params)
    respond_to do |format|
      if @template.save

UPDATE "templates" SET "name" = ?, "updated_at" = ? WHERE "templates"."id" = ?  [["name", "Anmärkning"], ["updated_at", "2017-11-09 12:10:35.244751"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @template.update(template_params)

DELETE FROM "templates" WHERE "templates"."id" = ?  [["id", 2]]
---
  def destroy
    @template.destroy