app/controllers/work_controller.rb

    def index
        @facilities = Facility.where().order(:name).page params[:page]
        @templates = Template.joins(:schedulings).where("start_date <?", DateTime.now)
---
SELECT "templates".* FROM "templates" INNER JOIN "schedulings" ON "schedulings"."template_id" = "templates"."id" LEFT OUTER JOIN "template_facility_items" ON "template_facility_items"."template_id" = "templates"."id" LEFT OUTER JOIN "facility_items" ON "facility_items"."id" = "template_facility_items"."facility_item_id" LEFT OUTER JOIN "facilities" ON "facilities"."id" = "facility_items"."facility_id" WHERE (start_date <='2017-11-14' AND end_date >='2017-11-14')