app/controllers/work_controller.rb

SELECT "facilities"."id" FROM "facilities" INNER JOIN "facility_items" ON "facilities"."id" = "facility_items"."facility_id" INNER JOIN "template_facility_items" ON "facility_items"."id" = "template_facility_items"."facility_item_id" WHERE "template_facility_items"."template_id" = ?  [["template_id", 1]]
SELECT DISTINCT facilities.name as f_name, facilities.id as f_id,templates.id, templates.name as t_name FROM "templates" INNER JOIN "schedulings" ON "schedulings"."template_id" = "templates"."id" LEFT OUTER JOIN "template_facility_items" ON "template_facility_items"."template_id" = "templates"."id" LEFT OUTER JOIN "facility_items" ON "facility_items"."id" = "template_facility_items"."facility_item_id" LEFT OUTER JOIN "facilities" ON "facilities"."id" = "facility_items"."facility_id" WHERE (start_date <='2017-11-14' AND end_date >='2017-11-14')
---
    def index
        @work = Template.joins(:schedulings, :facility).select("facilities.name as f_name, facilities.id, templates.name").distinct.where("start_date <?", DateTime.now)

SELECT  "templates".* FROM "templates" INNER JOIN "schedulings" ON "schedulings"."template_id" = "templates"."id" LEFT OUTER JOIN "template_facility_items" ON "template_facility_items"."template_id" = "templates"."id" LEFT OUTER JOIN "facility_items" ON "facility_items"."id" = "template_facility_items"."facility_item_id" LEFT OUTER JOIN "facilities" ON "facilities"."id" = "facility_items"."facility_id" WHERE (start_date <'2017-11-14') ORDER BY "templates"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
    def facility
        @templates = Template.joins(:schedulings).where("start_date <?", DateTime.now)

SELECT  "facilities".* FROM "facilities" WHERE "facilities"."id" = ? LIMIT ?  [["id", 153], ["LIMIT", 1]]
---
    def set_facility
      @facility = Facility.find(params[:facility_id])

SELECT  "templates".* FROM "templates" WHERE "templates"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
    def set_template
        @template = Template.find(params[:template_id])