app/controllers/work_controller.rb

SELECT "template_facility_items"."id" FROM "template_facility_items" WHERE "template_facility_items"."facility_item_id" = ?  [["facility_item_id", 159]]
---
    def set_facility_item
        @facility_item = FacilityItem.find(params[:facility_item_id])