app/views/facility_items/add.html.erb

          <div class="card-body">
              <% item.facility_items.each do |facility_item| %>
---
SELECT "template_facility_items"."id" FROM "template_facility_items" WHERE "template_facility_items"."facility_item_id" = ?  [["facility_item_id", 146]]

                  <label class="form-check-label">
                        <% if @template.template_facility_item.exists?(facility_item.template_facility_item) %>
---
SELECT  1 AS one FROM "template_facility_items" WHERE "template_facility_items"."facility_item_id" = ? AND "template_facility_items"."id" IN (SELECT "template_facility_items"."id" FROM "template_facility_items" WHERE "template_facility_items"."facility_item_id" = ?) LIMIT ?  [["facility_item_id", 155], ["facility_item_id", 155], ["LIMIT", 1]]
SELECT "template_facility_items"."id" FROM "template_facility_items" WHERE "template_facility_items"."template_id" = ?  [["template_id", 1]]